#include "cms32f033x.h"
#include "Psfr_hwdiv.h"

/*****************************************************************************
 ** 功能：	使能有符号除法器功能
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void HWDIV_EnableSingedMode(void)
{
	HWDIV->CON |= HDIV_CON_SIGN_Msk;
}

/*****************************************************************************
 ** 功能：	使能无符号除法器功能
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void HWDIV_EnableUnsingedMode(void)
{
	HWDIV->CON &= ~(HDIV_CON_SIGN_Msk);
}


/*****************************************************************************
 ** 功能：	实现 "/" (取商)
 ** 参数： [in] x:被除数
 **				y:除数
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
int32_t HWDIV_Div(int32_t x, int32_t y)
{
    uint32_t *Point;
    Point = (uint32_t *)& HWDIV->DIVD;
    *Point++ = x;
    *Point++ = y;
	while(!HWDIV_IS_IDLE()){;}
    return *Point;   
}
	  
/*****************************************************************************
 ** 功能：	实现 "%" (取余)
 ** 参数： [in] x:被除数
 **				y:除数
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
int32_t HWDIV_Mod(int32_t x, int32_t y)
{
    uint32_t *Point;
    Point = (uint32_t *)& HWDIV->DIVD;
    *Point++ = x;
    *Point++ = y;
	while(!HWDIV_IS_IDLE()){;}
    return (Point[1]);   
}


