#include "cms32f033x.h"
#include "Psfr_timer.h"

/*****************************************************************************
 ** 功能：	开启Timer
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_Start(TMR_T * Timer)
{
	Timer->CON |= TMR_CON_TMREN_Msk;
}

/*****************************************************************************
 ** 功能：	关闭Timer
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_Stop(TMR_T * Timer)
{
	Timer->CON &= ~(TMR_CON_TMREN_Msk);
}

/*****************************************************************************
 ** 功能：	设置定时器运行模式
 ** 参数： [in] Timer： TMR0、TMR1
 **				CountMode :  (1)TMR_COUNT_CONTINUONS_MODE		连续计数模式
 **					 		 (2)TMR_COUNT_PERIOD_MODE			周期计数模式
 **				Bits:  		 (1)TMR_BIT_16_MODE					16位模式
 **					   		 (2)TMR_BIT_32_MODE					32位模式
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_ConfigRunMode(TMR_T * Timer, uint32_t CountMode,uint32_t Bits)
{
	Timer->CON &= ~(TMR_CON_TMRMS_Msk |TMR_CON_TMRSZ_Msk);
	Timer->CON |= CountMode | Bits;
}

/*****************************************************************************
 ** 功能：	开启单次模式
 ** 参数： [in] Timer： TMR0、TMR1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_EnableOneShotMode(TMR_T * Timer)
{
	Timer->CON |= (TMR_CON_TMROS_Msk);
}

/*****************************************************************************
 ** 功能：	关闭单次模式
 ** 参数： [in] Timer： TMR0、TMR1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_DisableOneShotMode(TMR_T * Timer)
{
	Timer->CON &= ~(TMR_CON_TMROS_Msk);
}

/*****************************************************************************
 ** 功能：	设置定时器时钟
 ** 参数： [in] Timer： TMR0、TMR1
 **				ClkSel: (1)TMR_CLK_SEL_APB 		时钟源选择APB时钟
 **						(2)TMR_CLK_SEL_HSI		时钟源选择HSI时钟
 **						(3)TMR_CLK_SEL_LSI		时钟源选择LSI时钟
 **				ClkDiv :(1)TMR_CLK_DIV_1			
 **					   (2)TMR_CLK_DIV_16		
 **					   (3)TMR_CLK_DIV_256			
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_ConfigClk(TMR_T * Timer, uint32_t ClkSel, uint32_t ClkDiv)
{
	SYS->APBCKSEL = ClkSel;
	Timer->CON &= ~(TMR_CON_TMRPRE_Msk);
	Timer->CON |= ClkDiv;
}

/*****************************************************************************
 ** 功能：	设置定时器周期
 ** 参数： [in] timer : TMR0 、TMR1
 **				period: (1)0x00~0xffffffff (32位模式)
 **						(2)0x00~0xffff (16位模式)		
 ** 返回：  none
 ** 说明：	若计数器已经开始计数，则结束当前周期，立即以新周期重新计数
*****************************************************************************/
void TMR_SetPeriod(TMR_T * Timer, uint32_t period)
{
	Timer->LOAD = period;
}

/*****************************************************************************
 ** 功能：	延迟设置定时器周期
 ** 参数： [in] timer : TMR0 、TMR1
 **				period: (1)0x00~0xffffffff (32位模式)
 **						(2)0x00~0xffff (16位模式)		
 ** 返回：  none
 ** 说明：	若计数器已经开始计数，则下一个计数周期才生效
*****************************************************************************/
void TMR_SetPeriodBG(TMR_T * Timer, uint32_t period)
{
	Timer->BGLOAD = period;
}

/*****************************************************************************
 ** 功能：	开启定时器溢出中断
 ** 参数： [in] timer : TMR0 、TMR1		
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_EnableOverflowInt(TMR_T * Timer)
{
	Timer->CON |= TMR_CON_TMRIE_Msk;
}

/*****************************************************************************
 ** 功能：	关闭定时器溢出中断
 ** 参数： [in] timer : TMR0 、TMR1		
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_DisableOverflowInt(TMR_T * Timer)
{
	Timer->CON &= ~(TMR_CON_TMRIE_Msk);
}

/*****************************************************************************
 ** 功能：	获取定时器中断使能并溢出标志
 ** 参数： [in] timer : TMR0 、TMR1		
 ** 返回：  1: 中断使能并且产生中断  0 ：无中断
 ** 说明：	
*****************************************************************************/
uint32_t TMR_GetOverflowIntFlag(TMR_T * Timer)
{
	return((Timer->MIS & TMR_MIS_MIS_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	清除定时器中断溢出标志
 ** 参数： [in] timer : TMR0 、TMR1		
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void TMR_ClearOverflowIntFlag(TMR_T * Timer)
{
	Timer->ICLR = TMR_ICLR_ICLR_Msk;
}

/*****************************************************************************
 ** 功能：	获取定时器计数值
 ** 参数： [in] timer : TMR0 、TMR1		
 ** 返回：  data
 ** 说明：	
*****************************************************************************/
uint32_t TMR_GetTimingData(TMR_T * Timer)
{
	return(Timer->VAL);
}
