/*****************************************************************************
* 文件名：	Psfr_wdt.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#include "cms32f033x.h"
#include "Psfr_wdt.h"

/*****************************************************************************
 ** 功能：	开启WDT溢出复位系统
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	(1)使能WDT 复位，当发生WDT 中断后没有清中断标志位，下次发生WDT中断时触发WDT复位.
 **			(2)当使能复位时，都会使能WDT中断.
*****************************************************************************/
void WDT_EnableRestSystem(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->CON &= ~(WDT_WDTCON_WDTEN_Msk);
	WDT->LOCK = 0x0;	
}

/*****************************************************************************
 ** 功能：	关闭WDT溢出复位系统
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WDT_DisableRestSystem(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->CON &= ~(WDT_WDTCON_WDTEN_Msk);
	WDT->CON |= (WDT_CON_WRITE_KEY);
	WDT->LOCK = 0x0;		
}

/*****************************************************************************
 ** 功能：	配置WDT时钟
 ** 参数： [in] ClkDiv: (1)WDT_CLK_DIV_1   
 **						(2)WDT_CLK_DIV_16  
 **						(3)WDT_CLK_DIV_256 
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WDT_ConfigClk(uint32_t ClkDiv)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->CON &= ~(WDT_WDTCON_WDTPRE_Msk);
	WDT->CON |= (ClkDiv);
	WDT->LOCK = 0x0;		
}

/*****************************************************************************
 ** 功能：	配置WDT溢出周期
 ** 参数： [in] Period: 32BitValue
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_ConfigPeriod(uint32_t Period)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->LOAD = Period;
	WDT->LOCK = 0x0;	
}

/*****************************************************************************
 ** 功能：	开启WDT溢出中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_EnableOverflowInt(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->CON |= WDT_WDTCON_WDTIEN_Msk;
	WDT->LOCK = 0x0;			
}


/*****************************************************************************
 ** 功能：	关闭WDT溢出中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_DisableOverflowInt(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->CON &= ~(WDT_WDTCON_WDTIEN_Msk);
	WDT->LOCK = 0x0;
}

/*****************************************************************************
 ** 功能：	获取WDT使能并产生中断标志
 ** 参数： [in] none
 ** 返回：  1:使能中断并产生中断 0：无中断
 ** 说明：	 
*****************************************************************************/
uint32_t WDT_GetOverflowIntFlag(void)
{
	return((WDT->MIS & WDT_WDTMIS_WDTMIS_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	清除WDT中断标志并重新加载初值
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WDT_ClearOverflowIntFlag(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->ICLR = WDT_ICLR_WRITE_KEY;
	WDT->LOCK = 0x0;
}

/*****************************************************************************
 ** 功能：	获取WDT计数值
 ** 参数： [in] none
 ** 返回： 32bit value
 ** 说明：	 
*****************************************************************************/
uint32_t WDT_GetTimingData(void)
{
	return(WDT->VAL);
}

/*****************************************************************************
 ** 功能：	喂狗
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WDT_ClearWDT(void)
{
	WDT->LOCK = WDT_LOCK_WRITE_KEY;
	WDT->ICLR = WDT_ICLR_WRITE_KEY;
	WDT->LOCK = 0x0;
}

