/*****************************************************************************
* 文件名：	wwdt.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#include "cms32f033x.h"
#include "Psfr_wwdt.h"

/*****************************************************************************
 ** 功能：	开启WWDT模块
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WWDT_Start(void)
{
	WWDT->CON |= WWDT_WWDTCON_WWDTEN_Msk;
}

/*****************************************************************************
 ** 功能：	关闭WWDT模块
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WWDT_Stop(void)
{
	WWDT->CON &= ~(WWDT_WWDTCON_WWDTEN_Msk);
}

/*****************************************************************************
 ** 功能：	配置WWDT时钟
 ** 参数： [in] ClkDiv: (1)WWDT_CLK_DIV_2   
 **						(2)WWDT_CLK_DIV_4  
 **						(3)WWDT_CLK_DIV_8 
 **						(4)WWDT_CLK_DIV_16  
 **						(5)WWDT_CLK_DIV_32
 **						(6)WWDT_CLK_DIV_64  
 **						(7)WWDT_CLK_DIV_128 
 **						(8)WWDT_CLK_DIV_256  
 **						(9)WWDT_CLK_DIV_512 
 **						(10)WWDT_CLK_DIV_1024  
 **						(11)WWDT_CLK_DIV_2048 
 **						(12)WWDT_CLK_DIV_4096  
 **						(13)WWDT_CLK_DIV_8192 
 **						(14)WWDT_CLK_DIV_16384  
 ** 返回：  none
 ** 说明：	WWDT 计数器从0x3F 计数到0 时溢出的时间：(PSCSEL*1024*64)*TAPBCLK
*****************************************************************************/
void WWDT_ConfigClk(uint32_t ClkDiv)
{
	WWDT->CON &= ~(WWDT_WWDTCON_PSCSEL_Msk);
	WWDT->CON |= (ClkDiv);
}

/*****************************************************************************
 ** 功能：	配置WWDT比较值
 ** 参数： [in] Compare: 6BitValue
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WWDT_ConfigCompare(uint32_t Compare)
{
	WWDT->CON &= ~(WWDT_WWDTCON_CMPDAT_Msk);
	WWDT->CON |= ( (Compare & 0x3f) << WWDT_WWDTCON_CMPDAT_Pos);	
}

/*****************************************************************************
 ** 功能：	开启WWDT比较中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WWDT_EnableCompareInt(void)
{
	WWDT->CON |= WWDT_WWDTCON_WWDTIEN_Msk;	
}

/*****************************************************************************
 ** 功能：	关闭WWDT比较中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WWDT_DisableCompareInt(void)
{
	WWDT->CON &= ~(WWDT_WWDTCON_WWDTIEN_Msk);	
}

/*****************************************************************************
 ** 功能：	获取WWDT使能并产生中断标志
 ** 参数： [in] none
 ** 返回：  1:使能中断并产生中断 0：无中断
 ** 说明：	 
*****************************************************************************/
uint32_t WWDT_GetCompareIntFlag(void)
{
	return((WWDT->MIS & WWDT_WWDTMIS_WWDTMIS_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	清除WWDT中断标志
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WWDT_ClearCompareIntFlag(void)
{
	WWDT->ICLR |= WWDT_WWDTICLR_WWDTICLR_Msk;
}

/*****************************************************************************
 ** 功能：	获取WWDT计数值
 ** 参数： [in] none
 ** 返回： 6bit value
 ** 说明：	 
*****************************************************************************/
uint32_t WWDT_GetTimingData(void)
{
	return(0x3f & WWDT->VAL);
}

/*****************************************************************************
 ** 功能：	重载WWDT
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WWDT_Reload(void)
{
	WWDT->RL = WWDT_RL_WRITE_KEY;
}

