/*****************************************************************************
* 文件名：	Psfr_pga.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#include "cms32f033x.h"
#include "Psfr_pga.h"

/*****************************************************************************
 ** 功能：	设置PGA正端输入
 ** 参数： [in] pga :PGA0 、PGA1
 **				Positive:	(1)PGA_POSSEL_P0
 **							(2)PGA_POSSEL_P1
 **							(3)PGA_POSSEL_P2
 **							(4)PGA_POSSEL_P3
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigPositive(PGA_T *pga, uint32_t Positive)
{
	pga->CON0 &= ~(PGA_CON0_PS_Msk|PGA_CON0_EN_Msk);
	pga->CON0 |= Positive;
}

/*****************************************************************************
 ** 功能：	设置PGA增益
 ** 参数： [in] pga :PGA0 、PGA1
 **				Gain:  (1)PGA_GAIN_4		
 **					   (2)PGA_GAIN_8 
 **					   (3)PGA_GAIN_10 
 **					   (4)PGA_GAIN_12 
 **					   (5)PGA_GAIN_14 
 **					   (6)PGA_GAIN_16 
 **					   (6)PGA_GAIN_32 
 ** 返回：  none
 ** 说明：    
 *****************************************************************************/
void PGA_ConfigGain(PGA_T *pga, uint32_t Gain)
{
	pga->CON0 &= ~(PGA_CON0_GS_Msk);
	pga->CON0 |= Gain;	
}

/*****************************************************************************
 ** 功能：	设置PGA反馈电阻接地端
 ** 参数： [in] pga :PGA0 、PGA1
 **				Resistance:	(1)PGA_R_GND
 **							(2)PGA_R_PIN
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigResistance(PGA_T *pga, uint32_t Resistance)
{
	pga->CON0 &= ~(PGA_CON0_RGS_Msk|PGA_CON0_EN_Msk);
	pga->CON0 |= Resistance;	
}

/*****************************************************************************
 ** 功能：	设置PGA输出端
 ** 参数： [in] pga :PGA0 、PGA1
 **				Output:	(1)PGA_OUTSEL_O
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigOutput(PGA_T *pga, uint32_t Output)
{
	pga->CON0 &= ~(PGA_CON0_OS_Msk|PGA_CON0_EN_Msk);
	pga->CON0 |= Output;		
}

/*****************************************************************************
 ** 功能：	开启PGA
 ** 参数： [in] pga :PGA0 、PGA1
 ** 返回：  none	
 ** 说明：   
 *****************************************************************************/
void PGA_Start(PGA_T *pga)
{
	pga->CON0 |= PGA_CON0_EN_Msk;		
}

/*****************************************************************************
 ** 功能：	关闭PGA
 ** 参数： [in] pga :PGA0 、PGA1
 ** 返回：  none	
 ** 说明：    
 *****************************************************************************/
void PGA_Stop(PGA_T *pga)
{
	pga->CON0 &= ~(PGA_CON0_EN_Msk);	
}

