/*****************************************************************************
* 文件名：	Psfr_i2c.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#include "cms32f033x.h"
#include "Psfr_i2c.h"

/*****************************************************************************
 ** 功能：	设置I2C运行时钟
 ** 参数： [in] CLK_M: 0x00~0x7;
 **				CLK_N: 0x00~0xf;
 ** 返回：  none
 ** 说明：	采样时钟= PCLK/2M  ； SCL时钟= PCLK/（2M×（N+1）×10）
*****************************************************************************/
void I2C_ConfigClk(uint32_t CLK_M, uint32_t CLK_N)
{
	I2C->CLK = ((0x7 & CLK_M) <<4) | (0xf & CLK_N);
}

/*****************************************************************************
 ** 功能：	开启I2C接口
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void	I2C_EnableOutput(void)
{
	I2C->CONSET |= I2C_CONSSET_I2CEN_Msk;
}

/*****************************************************************************
 ** 功能：	关闭I2C接口
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_DisableOutput(void)
{
	I2C->CONCLR |= I2C_CONSCLR_I2CEMC_Msk;
}

/*****************************************************************************
 ** 功能：	开启I2C中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_EnableInt(void)
{
	I2C->CONSET |= I2C_CONSSET_I2CIE_Msk;
}

/*****************************************************************************
 ** 功能：	关闭I2C中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_DisableInt(void)
{
	I2C->CONCLR |= (I2C_CONSCLR_I2CIEC_Msk);
}

/*****************************************************************************
 ** 功能：	获取中断标志位
 ** 参数： [in] none
 ** 返回：  0：I2C发生总线状态未改变  1：I2C发生总线状态改变
 ** 说明：	
*****************************************************************************/
uint32_t I2C_GetIntFlag(void)
{
	return((I2C->CONSET & I2C_CONSSET_SI_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	清I2C中断标志
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_ClearIntFlag(void)
{
	I2C->CONCLR |= I2C_CONSCLR_SIC_Msk;
}

/*****************************************************************************
 ** 功能：	清I2C启动标志
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_ClearStartFlag(void)
{
	I2C->CONCLR |= I2C_CONSCLR_STAC_Msk;	
}

/*****************************************************************************
 ** 功能：	清I2C应答标志
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_ClearACKFlag(void)
{
	I2C->CONCLR |= I2C_CONSCLR_AAC_Msk;		
}

/*****************************************************************************
 ** 功能：	获取I2C状态
 ** 参数： [in] none
 ** 返回：  Status
 ** 说明：	
*****************************************************************************/
uint32_t I2C_GetStatus(void)
{
	return((I2C->STAT));
}

/*****************************************************************************
 ** 功能：	设置从机模式地址
 ** 参数： [in] Slave: I2C_S_7BIT_ADDR0~I2C_S_10BIT_ADDR0
 **				addr: 7位地址 或者10位地址
 **				Broadcast: I2C_S_BROADCAST_EN 、I2C_S_BROADCAST_DIS
 **				AddrMask: 7位掩码或者8位掩码
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_ConfigSlaveModeAddr(uint32_t Slave, uint32_t Addr, uint32_t Broadcast ,uint32_t AddrMask )
{
	switch(Slave)
	{
		case I2C_S_7BIT_ADDR0:
			I2C->ADR0 = (Addr<<1)| Broadcast;
			I2C->ADM0 = AddrMask;	
		break;
		case I2C_S_7BIT_ADDR1:
			I2C->ADR1 = (Addr<<1)| Broadcast;
			I2C->ADM1 = AddrMask;	
		break;	
		case I2C_S_7BIT_ADDR2:
			I2C->ADR2 = (Addr<<1)| Broadcast;
			I2C->ADM2 = AddrMask;	
		break;	
		case I2C_S_7BIT_ADDR3:
			I2C->ADR3 = (Addr<<1)| Broadcast;
			I2C->ADM3 = AddrMask;	
		break;	
		case I2C_S_10BIT_ADDR0:
			I2C->XADR0 = (Addr<<1)| Broadcast;
			I2C->XADM0 = AddrMask;	
		break;	
		default:
		break;
	}

}

/*****************************************************************************
 ** 功能：	获取I2C 从机10位地址标志位
 ** 参数： [in] none
 ** 返回： 0:I2C地址不匹配   1: 12C 10位地址匹配
 ** 说明：	
*****************************************************************************/
uint32_t I2C_GetSlave10BitAddrFlag(void)
{
	return((I2C->CONSET & I2C_CONSSET_XADRF_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	获取I2C 从机7位地址标志位
 ** 参数： [in] none
 ** 返回： 0:I2C地址不匹配   1: 12C 10位地址匹配
 ** 说明：	
*****************************************************************************/
uint32_t I2C_GetSlave7BitAddrFlag(void)
{
	return((I2C->CONSET & I2C_CONSSET_ADRF_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	复位I2C模块
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_Reset(void)
{
	I2C->RST = 0x07;
}

/*****************************************************************************
 ** 功能：	发送数据
 ** 参数： [in] I2CData
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendData(uint32_t I2CData)
{		
	I2C->DAT = I2CData;
}

/*****************************************************************************
 ** 功能：	发送应答位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendACK(void)
{
	I2C->CONSET |= I2C_CONSSET_AA_Msk;
}

/*****************************************************************************
 ** 功能：	不发送应答位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_NotSendACK(void)
{
	I2C->CONCLR |= I2C_CONSCLR_AAC_Msk;	
}

/*****************************************************************************
 ** 功能：	发送启始位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendStart(void)
{
	I2C->CONSET |= I2C_CONSSET_STA_Msk;	
}

/*****************************************************************************
 ** 功能：	发送重启位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendRestart(void)
{
	I2C->CONSET |= I2C_CONSSET_STA_Msk;	
}

/*****************************************************************************
 ** 功能：	发送停止位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendStop(void)
{
	I2C->CONSET |= I2C_CONSSET_STO_Msk;	
}

/*****************************************************************************
 ** 功能：	先发送一个停止位，接着发送一个启动位。
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void I2C_SendStopBeforeStart(void)
{
	I2C->CONSET |= I2C_CONSSET_STA_Msk | I2C_CONSSET_STO_Msk;	
}

/*****************************************************************************
 ** 功能：	获取数据
 ** 参数： [in] none
 ** 返回：  Data
 ** 说明：	
*****************************************************************************/
uint32_t I2C_GetData(void)
{
	return (0xff & I2C->DAT);
}
