#include "cms32f033x.h"
#include "Psfr_tick.h"

/*****************************************************************************
 ** 功能：	开启系统定时器
*****************************************************************************/
void TICK_Start(void)
{
	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
}

/*****************************************************************************
 ** 功能：	关闭系统定时器
*****************************************************************************/
void TICK_Stop(void)
{
	SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk);
}

/*****************************************************************************
 ** 功能：	开启系统定时器溢出中断
*****************************************************************************/
void TICK_EnableOverflowInt(void)
{
	SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;
}

/*****************************************************************************
 ** 功能：	关闭系统定时器溢出中断
*****************************************************************************/
void TICK_DisableOverflowInt(void)
{
	SysTick->CTRL &= ~(SysTick_CTRL_TICKINT_Msk);
}

/*****************************************************************************
 ** 功能：	获取系统定时器中断溢出标志
 ** 返回：	1: 产生中断  0 ：无中断
 ** 说明：	读取后，该标志位自动清零
*****************************************************************************/
uint32_t TICK_GetOverflowIntFlag(void)
{
	return((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	设置系统定时器的定时周期
 ** 参数： [in] period: 0x00~0xffffff (24位模式)
*****************************************************************************/
void TICK_SetPeriod(uint32_t period)
{
	SysTick->LOAD = period & 0x00ffffff;
}

/*****************************************************************************
 ** 功能：	获取系统定时器计数值
 ** 返回：  当前计数值
*****************************************************************************/
uint32_t TICK_GetTimingData(void)
{
	return(SysTick->VAL);
}

/*****************************************************************************
 ** 功能：	清除系统定时器当前计数值
 ** 说明：	会一并清除中断标志位
*****************************************************************************/
void TICK_ClearTimingData(void)
{
	SysTick->VAL = 0x0;
}

/*****************************************************************************
 ** 功能：	获取系统定时器TENMS的值是否准确
 ** 返回：	1: 不准确或不存在  0 ：准确
 ** 说明：	一个不准确的TENMS值，会影响SysTick作为软件实时时钟的匹配度
*****************************************************************************/
uint32_t TICK_GetTenmsRough(void)
{
	return((SysTick->CALIB & SysTick_CALIB_SKEW_Msk)? 1:0);
}

/*****************************************************************************
 ** 功能：	获取系统定时器TENMS的值
 ** 返回：	TENMS的值
 ** 说明：	为10ms定时作用的重装数值，同时受系统时钟偏差影响。
 ** 		如果这个值读出为0，则此校准值是不确定的。
*****************************************************************************/
uint32_t TICK_GetTenmsData(void)
{
	return(SysTick->CALIB & 0x00ffffff);
}

