/*****************************************************************************
* 文件名：	Psfr_uart.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_UART_H_
#define _PREG_UART_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 **UART 字长
-----------------------------------------------------------------------------*/
#define		UART_WLS_5			(0x00UL)		/*5位字长*/
#define		UART_WLS_6			(0x01UL)		/*6位字长*/
#define		UART_WLS_7			(0x02UL)		/*7位字长*/		
#define		UART_WLS_8			(0x03UL)		/*8位字长*/

/*----------------------------------------------------------------------------
 **UART 停止位
-----------------------------------------------------------------------------*/
#define		UART_STOP_BIT_1			(0x00UL)		/*1位停止位*/
#define		UART_STOP_BIT_2			(0x01UL<<UART_LCR_SBS_Pos)		/*2位停止位*/

/*----------------------------------------------------------------------------
 **UART 奇偶校验
-----------------------------------------------------------------------------*/
#define		UART_PARITY_NONE		(0x00UL)		/*无奇偶校验*/
#define		UART_PARITY_ODD			(0x00UL|(0x1<<UART_LCR_PEN_Pos))	/*奇偶校验*/
#define		UART_PARITY_EVEN		((0x01UL<<UART_LCR_PSEL_Pos)|(0x1<<UART_LCR_PEN_Pos))	/*偶偶校验*/
#define		UART_PARITY_FORCE_1		((0x02UL<<UART_LCR_PSEL_Pos)|(0x1<<UART_LCR_PEN_Pos))		/*校验位强制为1*/
#define		UART_PARITY_FORCE_0		((0x03UL<<UART_LCR_PSEL_Pos)|(0x1<<UART_LCR_PEN_Pos))		/*校验位强制为0*/

/*----------------------------------------------------------------------------
 **UART 中断状态标志
-----------------------------------------------------------------------------*/
#define		UART_INTFLAG_MODEM		(0x00UL)		/*MODEM状态发生改变*/
#define		UART_INTFLAG_TXD_EMPTY	(0x01UL)		/*发送保持寄存器为空*/
#define		UART_INTFLAG_RXD_FULL	(0x02UL)		/*接收数据有效*/		
#define		UART_INTFLAG_LINE		(0x03UL)		/*接收到线状态*/
#define		UART_INTFLAG_OVER		(0x06UL)		/*接收定时器溢出*/


/*****************************************************************************
 ** 功能：	配置异步串口运行模式
 ** 参数： [in] uart: UART0、UART1
 **				Baudrate:波特率
 **				WordLength:(1)UART_WLS_5
 **							(2)UART_WLS_6
 **							(3)UART_WLS_7
 **							(4)UART_WLS_8
 **				Parity:	(1)UART_PARITY_NONE
 **						(2)UART_PARITY_ODD
 **						(3)UART_PARITY_EVEN
 **						(4)UART_PARITY_FORCE_1
 **					 	(5)UART_PARITY_FORCE_0
 **				StopBit:(1)UART_STOP_BIT_1
 **						(2)UART_STOP_BIT_2
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_ConfigRunMode(UART_T* uart,uint32_t Baudrate,uint32_t WordLength, uint32_t Parity, uint32_t StopBit);

/*****************************************************************************
 ** 功能：	获取发送寄存器空标志位
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  1:空 0：非空
 ** 说明：	
*****************************************************************************/
uint32_t UART_TxdIsEmpty(UART_T* uart);


/*****************************************************************************
 ** 功能：	获取接收数据有效标志位
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  1:有未读数据 0：无未读数据
 ** 说明：	
*****************************************************************************/
uint32_t UART_RxdIsFull(UART_T* uart);

/*****************************************************************************
 ** 功能：	开启串口发送中断
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_EnableTxdInt(UART_T* uart);

/*****************************************************************************
 ** 功能：	关闭串口发送中断
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_DisableTxdInt(UART_T* uart);

/*****************************************************************************
 ** 功能：	开启串口接收中断
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_EnableRxdInt(UART_T* uart);

/*****************************************************************************
 ** 功能：	关闭串口接收中断
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_DisableRxdInt(UART_T* uart);

/*****************************************************************************
 ** 功能：	获取串口中断状态标志
 ** 参数： [in] uart: UART0、UART1
** 返回：  0:Modem状态发生改变  1:发送保持寄存器为空  2:接收数据有效  3:接收到线状态  6:接收定时器溢出
 ** 说明：	
*****************************************************************************/
uint32_t UART_GetIntFlag(UART_T* uart);

/*****************************************************************************
 ** 功能：	发送一个数据到串口
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void UART_Send(UART_T* uart, uint32_t Data);

/*****************************************************************************
 ** 功能：	接收一个数据从串口
 ** 参数： [in] uart: UART0、UART1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
uint32_t UART_Rece(UART_T* uart);


#ifdef __cplusplus
}
#endif

#endif /* _PREG_UART_H_ */

