/*****************************************************************************
* 文件名：	Psfr_ccp.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_CCP_H_
#define _PREG_CCP_H_
 
#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 ** CCP 模块 & 通道
-----------------------------------------------------------------------------*/
#define		CCP0			(0x00UL)		/*CCP模块0*/
#define		CCP1			(0x01UL)		/*CCP模块1*/	
/*----------PWM模式/捕获模式0通道--------------------------------------------*/
#define		CCPxA			(0x00UL)
#define		CCPxB			(0x01UL)

/*----------捕获模式1内部通道------------------------------------------------*/
#define		CAP0			(0x00UL)
#define		CAP1			(0x01UL)
#define		CAP2			(0x02UL)
#define		CAP3			(0x03UL)
/*----------捕获模式1 内部通道都可选的外部通道-------------------------------*/
#define		ECAP00			(0x00UL)
#define		ECAP01			(0x01UL)
#define		ECAP02			(0x02UL)
#define		ECAP03			(0x03UL)

#define		ECAP10			(0x10UL)
#define		ECAP11			(0x11UL)
#define		ECAP12			(0x12UL)
#define		ECAP13			(0x13UL)

/*----------捕获模式1 可选ACMP通道---------------------------------------------*/
#define		CAP3_ACMP0		(0x38UL)
#define		CAP3_ACMP1		(0x39UL)
/*----------捕获模式1 可选CCPn通道---------------------------------------------*/
#define		CAP0_CCP0A		(0x0FUL)
#define		CAP1_CCP0B		(0x1FUL)
#define		CAP2_CCP1A		(0x2FUL)
#define		CAP3_CCP1B		(0x3FUL)


/*----------------------------------------------------------------------------
 ** CCP 模式
-----------------------------------------------------------------------------*/
#define		CCP_PWM_MODE		(0x00UL)		/*CCP模块PWM输出模式*/
#define 	CCP_CAP0_MODE		(0x01UL)		/*CCP模块捕获模式0*/
#define 	CCP_CAP1_MODE		(0x02UL)		/*CCP模块捕获模式1*/

/*----------------------------------------------------------------------------
 ** CCP 计数器重载模式
-----------------------------------------------------------------------------*/
#define		CCP_RELOAD_0XFFFF		(0x00)		/*计数器重加载值为0xFFFF*/
#define		CCP_RELOAD_CCPLOAD		(0x01)		/*计数器器重加载值为CCPxLOAD*/
/*----------------------------------------------------------------------------
 ** CCP 时钟
-----------------------------------------------------------------------------*/
#define		CCP_CLK_DIV_1		(0x00UL)		/*Fccp = PCLK/1*/
#define		CCP_CLK_DIV_4		(0x01UL)		/*Fccp = PCLK/4*/
#define		CCP_CLK_DIV_16		(0x02UL)		/*Fccp = PCLK/16*/
#define		CCP_CLK_DIV_64		(0x03UL)		/*Fccp = PCLK/64*/

/*----------------------------------------------------------------------------
 ** CCP 捕获模式
-----------------------------------------------------------------------------*/
/*----------捕获模式0---------------------------------------------*/
#define		CCP_CAP_MODE0_RISING				(0x00)	/*上升沿捕获*/
#define		CCP_CAP_MODE0_FALLING				(0x01)	/*下降沿捕获*/
#define		CCP_CAP_MODE0_RISING_TO_FALLING		(0x02)	/*捕获从上升沿到下降沿*/
#define		CCP_CAP_MODE0_FALLING_TO_RISING		(0x03)  /*捕获从下降沿到上升沿*/
/*----------捕获模式1------------------------------------------------*/
#define 	CCP_CAP_MODE1_DISABLE				(0x00)	/*捕获禁止*/
#define		CCP_CAP_MODE1_RISING				(0x01)	/*上升沿捕获*/
#define		CCP_CAP_MODE1_FALLING				(0x02)	/*下降沿捕获*/
#define		CCP_CAP_MODE1_BOTH_EDGE				(0x03)	/*双沿(下降沿&&上升沿)捕获*/
/*----------------------------------------------------------------------------
 ** CCP 写保护
-----------------------------------------------------------------------------*/
#define		CCP_P1A_WRITE_KEY		(0xAAUL)
#define		CCP_P1AB_WRITE_KEY		(0x55UL)




/*****************************************************************************
 ** 功能：	开启CCP模块
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void CCP_Start(uint32_t CCPn );

/*****************************************************************************
 ** 功能：	关闭CCP模块
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void CCP_Stop(uint32_t CCPn );

/*****************************************************************************
 ** 功能：	设置CCPn模块时钟
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 **				ClkDiv:(1) CCP_CLK_DIV_1
 **					   (2) CCP_CLK_DIV_4
 **					   (3) CCP_CLK_DIV_16
 **					   (4) CCP_CLK_DIV_64
 **				ReloadMode: (1) CCP_RELOAD_0XFFFF    计数器重加载值为0xFFFF (连续模式)
 **							(2) CCP_RELOAD_CCPLOAD   计数器器重加载值为CCPxLOAD
 **				Preiod: 0x00~ 0xffff; （建议加载值不为0）		
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_ConfigCLK(uint32_t CCPn, uint32_t ClkDiv ,uint32_t ReloadMode, uint32_t Period);

/*****************************************************************************
 ** 功能：	读取CCPn模块的重加载值
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  重加载值
*****************************************************************************/
uint16_t CCP_ReadLoad(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	CCPn开启
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnableRun(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	CCPn关闭
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_DisableRun(uint32_t CCPn);


/*****************************************************************************
 ** 功能：	开启PWM运行模式
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnablePWMMode(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	设置CCPn模块通道n 比较值
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 **				CCPChannel: CCPxA 、CCPxB			
 **				Compare : 0x00~ 0xffff;
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_ConfigCompare(uint32_t CCPn, uint32_t CCPChannel ,uint32_t Compare);

/*****************************************************************************
 ** 功能：	设置CCPn模块通道n的占空比百分率
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 **				CCPChannel: CCPxA 、CCPxB			
 **			    DutyScale	: 占空比百分率 (0~100)
 ** 返回： none
*****************************************************************************/
void CCP_ConfigDutyScale(uint32_t CCPn, uint32_t CCPChannel, uint8_t DutyScale);

/*****************************************************************************
 ** 功能：	开启反相输出
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 **				CCPChannel: CCPxA 、CCPxB
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnableReverseOutput(uint32_t CCPn, uint32_t CCPChannel);

/*****************************************************************************
 ** 功能：	关闭反相输出
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 **				CCPChannel: CCPxA 、CCPxB
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_DisableReverseOutput(uint32_t CCPn, uint32_t CCPChannel);

/*****************************************************************************
 ** 功能：	开启溢出中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnableOverflowInt(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	关闭溢出中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_DisableOverflowInt(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	获取溢出中断使能并溢出中断标志位
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  1:溢出中断使能并且产生中断  0:无中断
 ** 说明：	
*****************************************************************************/
uint32_t CCP_GetOverflowIntFlag(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	清除溢出中断标志位
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_ClearOverflowIntFlag(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	开启PWM比较中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnableCompareInt(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	关闭比较中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_DisableCompareInt(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	获取比较中断使能并产生中断标志
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
uint32_t  CCP_GetCompareIntFlag(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	清除比较中断标志
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_ClearCompareIntFlag(uint32_t CCPn);


/*****************************************************************************
 ** 功能：	开启捕获模式0
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_EnableCAPMode0(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	配置捕获模式0 的捕获方式
 ** 参数： [in] CCPn : CCP0模块、CCP1模块	
 **				Mode : (1)CCP_CAP_RISING
 **					   (2)CCP_CAP_FALLING
 **					   (3)CCP_CAP_RISING_TO_FALLING
 **					   (4)CCP_CAP_FALLING_TO_RISING
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_ConfigCAPMode0(uint32_t CCPn, uint32_t Mode);

/*****************************************************************************
 ** 功能：	选择捕获模式0 的捕获通道
 ** 参数： [in] CCPn : CCP0模块、CCP1模块	
**				Channel : CCPxA 、CCPxB 
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_SelCAPMode0Channel(uint32_t CCPn, uint32_t Channel);

/*****************************************************************************
 ** 功能：	获取捕获模式0 的捕获通道值
 ** 参数： [in] CCPn : CCP0模块、CCP1模块	
**				Channel : CCPxA 、CCPxB 
 ** 返回：  16bit result
 ** 说明：	
*****************************************************************************/
uint32_t  CCP_GetCAPMode0Result(uint32_t CCPn, uint32_t Channel);

/*****************************************************************************
 ** 功能：	开启捕获模式捕获中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_EnableCAPMode0Int(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	关闭捕获模式捕获中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void CCP_DisableCAPMode0Int(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	获取捕获模式捕获中断使能并且产生中断
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回： 1：产生中断  0:无中断
 ** 说明：	
*****************************************************************************/
uint32_t CCP_GetCAPMode0IntFlag(uint32_t CCPn);

/*****************************************************************************
 ** 功能：	清除捕获模式捕获中断标志位
 ** 参数： [in] CCPn : CCP0模块、CCP1模块
 ** 返回： none
 ** 说明：	
*****************************************************************************/
void CCP_ClearCAPMode0IntFlag(uint32_t CCPn);


/*****************************************************************************
 ** 功能：	开启捕获模式1 
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_EnableCAPMode1(void);

/*****************************************************************************
 ** 功能：	关闭捕获模式1 
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_DisableCAPMode1(void);

/*****************************************************************************
 ** 功能：	开启捕获模式1下CAPn捕获触发CCP0加载
 ** 参数： [in] CAPn: CAP0、CAP1、CAP2、CAP3 
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_EnableCAPnReload(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	关闭捕获模式1下CAPn捕获触发CCP0加载
 ** 参数： [in] CAPn: CAP0、CAP1、CAP2、CAP3 
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_DisableCAPnReload(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	配置捕获模式1 通道捕获模式
 ** 参数： [in] CAPn: CAP0、CAP1、CAP2、CAP3 
 **				Mode:(1)CCP_CAP_MODE1_RISING
 **					 (2)CCP_CAP_MODE1_FALLING
 **					 (3)CCP_CAP_MODE1_BOTH_EDGE
 **					 (4)CCP_CAP_MODE1_DISABLE
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_ConfigCAPMode1(uint32_t CAPn, uint32_t Mode);

/*****************************************************************************
 ** 功能：	选择捕获模式1 的捕获通道
 ** 参数： [in] CAPn: CAP0、CAP1、CAP2、CAP3 
 **				Channel :(1) ECAP00 ~ ECAP03
 **						 (2) ECAP10 ~ ECAP13
 **						 (3) CAP0_CCP0A 、CAP1_CCP0B、CAP2_CCP1A、CAP3_CCP1B
 **						 (4) CAP3_ACMP0、CAP3_ACMP1 ：  CAP3通道特有
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void  CCP_SelCAPMode1Channel(uint32_t CAPn, uint32_t Channel);

/*****************************************************************************
 ** 功能：	写寄存器触发捕获模式1捕获功能
 ** 参数： [in] CAPn ：CAP0 、CAP1、CAP2 、CAP3
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void CCP_TriggerCaputer(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	获取捕获模式1 的捕获通道值
 ** 参数： [in] CAPn ：CAP0 、CAP1、CAP2 、CAP3	
 ** 返回：  16bit result
 ** 说明：	
*****************************************************************************/
uint32_t  CCP_GetCAPMode1Result(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	开启捕获模式1中断
 ** 参数： [in]CAPn ：CAP0 、CAP1、CAP2 、CAP3	
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void CCP_EnableCAPMode1Int(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	关闭捕获模式1中断
 ** 参数： [in]CAPn ：CAP0 、CAP1、CAP2 、CAP3	
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void CCP_DisableCAPMode1Int(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	获取捕获模式1中断使能并且产生中断标志位
 ** 参数： [in]CAPn ：CAP0 、CAP1、CAP2 、CAP3	
 ** 返回：  1:中断使能并且产生中断   0：无中断
 ** 说明：	 
*****************************************************************************/
uint32_t  CCP_GetCAPMode1IntFlag(uint32_t CAPn);

/*****************************************************************************
 ** 功能：	清除捕获模式1中断标志位
 ** 参数： [in]CAPn ：CAP0 、CAP1、CAP2 、CAP3	
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void  CCP_ClearCAPMode1IntFlag(uint32_t CAPn);

void CCP_Config_PWM_Mode(void);


#ifdef __cplusplus
}
#endif

#endif /* _PREG_CCP_H_ */

