/*****************************************************************************
* 文件名：	Psfr_pga.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_PGA_H_
#define _PREG_PGA_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 **PGA	增益选择
-----------------------------------------------------------------------------*/
#define		PGA_GAIN_4			(0x00UL)					/*设置增益为4x*/
#define		PGA_GAIN_8			(0x01UL<<PGA_CON0_GS_Pos)	/*设置增益为8x*/
#define		PGA_GAIN_10			(0x02UL<<PGA_CON0_GS_Pos)	/*设置增益为10x*/
#define		PGA_GAIN_12			(0x03UL<<PGA_CON0_GS_Pos)	/*设置增益为12x*/			
#define		PGA_GAIN_14			(0x04UL<<PGA_CON0_GS_Pos)	/*设置增益为14x*/
#define		PGA_GAIN_16			(0x05UL<<PGA_CON0_GS_Pos)	/*设置增益为16x*/	
#define		PGA_GAIN_32			(0x06UL<<PGA_CON0_GS_Pos)	/*设置增益为32x*/
/*----------------------------------------------------------------------------
 **PGA	反馈电阻接地端选择
-----------------------------------------------------------------------------*/
#define		PGA_R_GND			(0x00UL)					/*接到模块的地*/
#define		PGA_R_PIN			(0x01UL<<PGA_CON0_RGS_Pos)	/*接到专用地线PIN*/
/*----------------------------------------------------------------------------
 **PGA	输出端
-----------------------------------------------------------------------------*/
#define		PGA_OUTSEL_O		(0x01UL<<PGA_CON0_OS_Pos)					
/*----------------------------------------------------------------------------
 **PGA	正端
-----------------------------------------------------------------------------*/
#define		PGA_POSSEL_P0		(0x00UL)					/*接到PGA P0*/
#define		PGA_POSSEL_P1		(0x01UL<<PGA_CON0_PS_Pos)	/*接到PGA P1*/
#define		PGA_POSSEL_P2		(0x02UL<<PGA_CON0_PS_Pos)	/*接到PGA P2*/
#define		PGA_POSSEL_P3		(0x03UL<<PGA_CON0_PS_Pos)	/*接到PGA P3*/


/*****************************************************************************
 ** 功能：	PGA_SEL_POS
 **			选择PGA的正端输入
 ** 参数： [in] Pos:(1)PGA_POSSEL_P0
 **					(2)PGA_POSSEL_P1
 **					(3)PGA_POSSEL_P2
 **					(4)PGA_POSSEL_P3
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
#define		PGA_SEL_POS(pga, Pos)	do{\
										pga->CON0 &= ~(PGA_CON0_PS_Msk);\
										pga->CON0 |= Pos;\
									  }while(0)
							
/*****************************************************************************
 ** 功能：	设置PGA正端输入
 ** 参数： [in] pga :PGA0 、PGA1
 **				Positive:	(1)PGA_POSSEL_P0
 **							(2)PGA_POSSEL_P1
 **							(3)PGA_POSSEL_P2
 **							(4)PGA_POSSEL_P3
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigPositive(PGA_T *pga, uint32_t Positive);

/*****************************************************************************
 ** 功能：	设置PGA增益
 ** 参数： [in] pga :PGA0 、PGA1
 **				Gain:  (1)PGA_GAIN_4		
 **					   (2)PGA_GAIN_8 
 **					   (3)PGA_GAIN_10 
 **					   (4)PGA_GAIN_12 
 **					   (5)PGA_GAIN_14 
 **					   (6)PGA_GAIN_16 
 **					   (6)PGA_GAIN_32 
 ** 返回：  none
 ** 说明：    
 *****************************************************************************/
void PGA_ConfigGain(PGA_T *pga, uint32_t Gain);

/*****************************************************************************
 ** 功能：	设置PGA反馈电阻接地端
 ** 参数： [in] pga :PGA0 、PGA1
 **				Resistance:	(1)PGA_R_GND
 **							(2)PGA_R_PIN
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigResistance(PGA_T *pga, uint32_t Resistance);

/*****************************************************************************
 ** 功能：	设置PGA输出端
 ** 参数： [in] pga :PGA0 、PGA1
 **				Output:	(1)PGA_OUTSEL_O
 ** 返回：  none	
 ** 说明：   默认关闭PGA模块
 *****************************************************************************/
void PGA_ConfigOutput(PGA_T *pga, uint32_t Output);

/*****************************************************************************
 ** 功能：	开启PGA
 ** 参数： [in] pga :PGA0 、PGA1
 ** 返回：  none	
 ** 说明：   
 *****************************************************************************/
void PGA_Start(PGA_T *pga);

/*****************************************************************************
 ** 功能：	关闭PGA
 ** 参数： [in] pga :PGA0 、PGA1
 ** 返回：  none	
 ** 说明：    
 *****************************************************************************/
void PGA_Stop(PGA_T *pga);





#ifdef __cplusplus
}
#endif

#endif /* _PREG_ */

