/*****************************************************************************
* 文件名：	Psfr_opa.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_OPA_H_
#define _PREG_OPA_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 **OPA	工作模式
-----------------------------------------------------------------------------*/
#define		OPA_FIL_CMP			(0x01UL<<OPA_CON0_FIL_Pos)	/*比较模式*/
#define		OPA_FIL_OPA			(0x00UL)					/*运放模式*/
/*----------------------------------------------------------------------------
 **OPA	正端选择
-----------------------------------------------------------------------------*/
#define		OPA_POSSEL_P		(0x00UL)					/*选择OPA P*/
#define		OPA_POSSEL_1P2		(0x01UL<<OPA_CON0_PS_Pos)	/*选择1.2V Bandgap*/	
/*----------------------------------------------------------------------------
 **OPA	负端选择
-----------------------------------------------------------------------------*/
#define		OPA_NEGSEL_N		(0x00UL)					/*选择OPA N*/
/*----------------------------------------------------------------------------
 **OPA	输出选择
-----------------------------------------------------------------------------*/
#define		OPA_OUTSEL_O		(0x01UL<<OPA_CON0_OS_Pos)	/*选择OPA O*/

/*----------------------------------------------------------------------------
 **opa 调节
------------------------------------------------------------------------------*/
#define OPA_ADJ_SEL_N			(0x00)		/*opa调节模式输入端选择负端*/
#define OPA_ADJ_SEL_P			(0x01<<OPA_CON1_CRS_Pos)		/*opa调节模式输入端选择正端*/
#define OPA_ADJ_USE_CONFIG		(0xFF)		/*opa调节模式失调电压由Config决定*/
#define OPA_ADJ_USE_OPADJ		(0xAA)		/*opa调节模式失调电压由OPnADJ[4:0]决定*/


							
/*****************************************************************************
 ** 功能：	设置运放运行模式
 ** 参数： [in] opa :OPA0 、OPA1
 **				mode: (1)OPA_FIL_CMP
 **					  (2)OPA_FIL_OPA
 ** 返回：  none
 ** 说明：    
 *****************************************************************************/
void OPA_ConfigRunMode(OPA_T *opa, uint32_t mode);

/*****************************************************************************
 ** 功能：	设置运放正端输入
 ** 参数： [in] opa :OPA0 、OPA1
 **				PositiveSource:  (1)OPA_POSSEL_P	:OPnP
 **								 (2)OPA_POSSEL_1P2 
 ** 返回：  none
 ** 说明：   默认关闭运放模块
 *****************************************************************************/
void OPA_ConfigPositive(OPA_T *opa, uint32_t PositiveSource);

/*****************************************************************************
 ** 功能：	设置比较器负端输入
 ** 参数： [in] opa :OPA0 、OPA1
 **				NegativeSource:  (1)OPA_NEGSEL_N		:OPnN			
 ** 返回：  none
 ** 说明：  默认关闭运放模块
 *****************************************************************************/
void OPA_ConfigNegative(OPA_T *opa, uint32_t NegativeSource);

/*****************************************************************************
 ** 功能：	设置比较器输出端
 ** 参数： [in] opa :OPA0 、OPA1
 **				OutSource:	OPA_OUTSEL_O
 ** 返回：  none
 ** 说明：  
 *****************************************************************************/
void OPA_ConfigOutput(OPA_T *opa,uint32_t OutSource);


/********************************************************************************
 ** 功能：	开启OP
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  none
 ** 说明：   
 ******************************************************************************/
void OPA_Start(OPA_T *opa);

/********************************************************************************
 ** 功能：	关闭OP
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  none
 ** 说明：  
 ******************************************************************************/
void OPA_Stop(OPA_T *opa);

/********************************************************************************
 ** 功能：	获取调节模式的调节结果/比较模式的比较结果
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  0/1
 ** 说明：  
 ******************************************************************************/
uint32_t OPA_GetResult(OPA_T *opa);

/*****************************************************************************
 ** 功能：	开启运放调节模式
 ** 参数： [in] opa :OPA0 、OPA1
 **				AdjustTarget:    (1)OPA_ADJ_SEL_N		:调节作用于负端输入		
 **								 (2)OPA_ADJ_SEL_P		:调节作用于正端输入	
 ** 返回：  none
 ** 说明：  
 *****************************************************************************/
void OPA_EnableAdjustMode(OPA_T *opa, uint32_t AdjustTarget);

/*****************************************************************************
 ** 功能：	关闭运放调节模式
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  none
 ** 说明：   
 *****************************************************************************/
void OPA_DisableAdjustMode(OPA_T *opa);

/*****************************************************************************
 ** 功能：	开启运放Config调节
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  none
 ** 说明：  使用Config调节值
 *****************************************************************************/
void OPA_EnableConfigAdjust(OPA_T *opa);

/*****************************************************************************
 ** 功能：	开启运放OPADJ调节
 ** 参数： [in] opa :OPA0 、OPA1
 **				AdjustValue: 0x00 ~ 0x1f
 ** 返回：  none
 ** 说明：  使用OPnADJ寄存器中的OPnADJ<4:0>
 *****************************************************************************/
void OPA_EnableOPADJAdjust(OPA_T *opa, uint32_t AdjustValue);

/*****************************************************************************
 ** 功能：	获取运放调节模式结果
 ** 参数： [in] opa :OPA0 、OPA1
 ** 返回：  Result
 ** 说明：    
 *****************************************************************************/
uint32_t  OPA_GetAutoAdjustResult(OPA_T *opa);



#ifdef __cplusplus
}
#endif

#endif /* _PREG_OPA_H_ */

