/*****************************************************************************
* 文件名：	system_cms32f030x.h
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _SYSTEM_CMS32F033_H_
#define _SYSTEM_CMS32F033_H_

#ifdef __cplusplus
extern "C" {
#endif

#include  "stdint.h"

/*----------------------------------------------------------------------------
 ** System 系统时钟
------------------------------------------------------------------------------*/
#define __HIRC_64M			(64000000ul)  			/*内部高速64M 时钟*/
#define __HIRC_48M    	    (48000000ul)    	  	/*内部高速48M时钟*/
#define __LIRC   			(40000ul)    	 	    /*内部低速48M时钟*/


extern uint32_t SystemCoreClock;  			/*系统时钟或AHB时钟*/
extern uint32_t SystemAPBClock;    			/*系统的APB时钟*/
extern uint32_t CyclesPerUs;     			/*系统时钟周期*/


/*****************************************************************************
 ** 功能：	系统初始化
*****************************************************************************/
void  SystemInit(void);

/*****************************************************************************
 ** 功能：	加载SystemCoreClock值
*****************************************************************************/
extern void SystemCoreClockUpdate(void);


#ifdef __cplusplus
}
#endif

#endif /*_SYSTEM_CMS32F033_H_*/


