/*****************************************************************************
* 文件名：	Psfr_fmc.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_FMC_H_
#define _PREG_FMC_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

#define FMC_Lock_Key                        ((uint32_t)(0x55AA6699))     
     
#define FMC_FMCCON_FMCBNormal               ((uint32_t)(0x00000000))
#define FMC_FMCCON_FMCBBusy                 ((uint32_t)(0x00000020))
#define FMC_FMCCON_FMCBISPS                 ((uint32_t)(0x00000010))

#define FMC_FMCCON_FMCE_MapEn               ((uint32_t)(0x00000000))
#define FMC_FMCCON_FMCE_MapDis              ((uint32_t)(0x00000010))
     
#define FMC_FMCCMD_ReadData                 ((uint32_t)(0x00000001))
#define FMC_FMCCMD_WriteData                ((uint32_t)(0x00000002))
#define FMC_FMCCMD_ErasPage                 ((uint32_t)(0x00000003))
#define FMC_FMCCMD_ErasAll                  ((uint32_t)(0x00000006))
#define FMC_FMCCMD_CRC                  	((uint32_t)(0x0000000D))     
     
#define FMC_WORD_ALIGN_MSK                 	((uint32_t)(0x00FFFFFC))
#define FMC_DATA_BASE_MSK                 	((uint32_t)(0x1C000000))
     

#define	CODE_ROM_SIZE		0x8000UL		// CodeROM容量 32K 字节
#define	DATA_ROM_SIZE		0x0400UL		// DataROM容量  1K 字节
#define	PAGE_SIZE			512UL			// 扇区页大小  512 字节


/*****************************************************************************
 ** 功能：	使能操作FMC寄存器
*****************************************************************************/
void FMC_UnLock(void);

/*****************************************************************************
 ** 功能：	禁止操作FMC寄存器
*****************************************************************************/
void FMC_Lock(void);

/*****************************************************************************
 ** 功能：	等待FMC编程、擦除等操作完成
*****************************************************************************/
void FMC_WaitIdle(void);

/*****************************************************************************
 ** 功能：	擦除整个芯片
*****************************************************************************/
void FMC_ErasAll(void);

/*****************************************************************************
 ** 功能：	擦除CodeROM区指定的页
 ** 参数：	PageAddr: 页首地址
*****************************************************************************/
void FMC_CodeROM_ErasPage(uint32_t PageAddr);

/*****************************************************************************
 ** 功能：	写一个字宽度的数据到CodeROM区指定的地址
 ** 说明：	写入之前须确保已执行擦除
 ** 参数：	WordAddr: CodeROM区指定的地址
 ** 		Data:     待写入的字宽数据
*****************************************************************************/
void FMC_CodeROM_WriteWord(uint32_t WordAddr,uint32_t Data);

/*****************************************************************************
 ** 功能：	从CodeROM区指定的地址读一个字宽度的数据
 ** 参数：	WordAddr: CodeROM区指定的地址
 ** 返回：	读到的字宽数据
*****************************************************************************/
uint32_t FMC_CodeROM_ReadWord(uint32_t WordAddr);

/*****************************************************************************
 ** 功能：	擦除DataROM区指定的页
 ** 参数：	PageAddr: 页首地址
*****************************************************************************/
void FMC_DataROM_ErasPage(uint32_t PageAddr);

/*****************************************************************************
 ** 功能：	写一个字宽度的数据到DataROM区指定的地址
 ** 说明：	写入之前须确保已执行擦除
 ** 参数：	WordAddr: DataROM区指定的地址
 ** 		Data:     待写入的字宽数据
*****************************************************************************/
void FMC_DataROM_WriteWord(uint32_t WordAddr,uint32_t Data);

/*****************************************************************************
 ** 功能：	从DataROM区指定的地址读一个字宽度的数据
 ** 参数：	WordAddr: DataROM区指定的地址
 ** 返回：	读到的字宽数据
*****************************************************************************/
uint32_t FMC_DataROM_ReadWord(uint32_t WordAddr);

/**************************************************************************************************
* 功能:		从DataROM指定位置读取指定数量的数据
* 参数:		memAddr		待读取数据所在位置
* 			Size		待读取数据的字节个数（以字为单位读取，须确保是4的倍数）
* 			buffer		读取到的数据的存放地址
* 返回值:	0:成功
* 			1:读取地址或数量超出DataROM的容量范围
* 			2:无需读取（参数size为0）
* 说明1:	该函数访问1KB内区域的DataROM存储器。
**************************************************************************************************/
uint32_t FMC_DataROM_Read(uint32_t memAddr, uint32_t Size, uint32_t *buffer);

/**************************************************************************************************
* 功能:		将指定数量的数据写入DataROM指定位置
* 参数:		memAddr		数据写入到的目标位置
* 			Size		待写入数据的字节个数（以字为单位读取，须确保是4的倍数）
* 			buffer		待写入数据所在位置
* 返回值:	0:成功
* 			1:写入地址或数量超出DataROM的容量范围
* 			2:无需写入（参数size为0）
* 			3:写入失败
* 说明1:	该函数访问1KB内区域的DataROM存储器。
* 说明2:	写入数据之前，该函数会自动擦除写入数据所在扇区（512字节）。如果一次只更新某个扇区内的部分内容，则该扇区内的其他数据将丢失。
* 说明3:	该函数对系统扇区内的数据执行写入时，只能将0写为1，不能将1再写回0。（因为软件擦除该扇区时不会成功）
**************************************************************************************************/
uint32_t FMC_DataROM_Writ(uint32_t memAddr, uint32_t Size, uint32_t *buffer);



#ifdef __cplusplus
}
#endif

#endif /* _PREG_FMC_H_ */

