/*****************************************************************************
* 文件名：	Psfr_wdt.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_WDT_H_
#define _PREG_WDT_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 **WDT 时钟
-----------------------------------------------------------------------------*/
#define		WDT_CLK_DIV_1		(0x00UL)	/*WDT clk 1 分频*/
#define		WDT_CLK_DIV_16		(0x01UL<<WDT_WDTCON_WDTPRE_Pos)	/*WDT clk 16 分频*/
#define		WDT_CLK_DIV_256		(0x02UL<<WDT_WDTCON_WDTPRE_Pos)	/*WDT clk 256 分频*/
/*----------------------------------------------------------------------------
 **WDT 写保护
-----------------------------------------------------------------------------*/
#define		WDT_ICLR_WRITE_KEY	(0x55AA55AAUL)
#define		WDT_LOCK_WRITE_KEY	(0x55AA6699UL)
#define		WDT_CON_WRITE_KEY	(0x5AUL<<WDT_WDTCON_WDTEN_Pos)

/*****************************************************************************
 ** 功能：	WDT_GET_RIS_FLAG
 **			获取WDT中断源状态
 ** 参数： [in] none
 ** 返回：  1:产生WDT向下溢出中断 0：无中断
 ** 说明：	 
*****************************************************************************/
#define		WDT_GET_RIS_FLAG()	(((WDT->RIS &WDT_WDTRIS_WDTRIS_Msk)? 1:0))

/*****************************************************************************
 ** 功能：	WDT_ENABLE_DEBUG
 **			WDT在DEBUG模式中使能
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
#define		WDT_ENABLE_DEBUG()	do{\
									WDT->LOCK = WDT_LOCK_WRITE_KEY;\
									WDT->CON |= WDT_WDTCON_DEBUG_Msk;\
									WDT->LOCK = 0x0;\
								}while(0)
/*****************************************************************************
 ** 功能：	WDT_DISABLE_DEBUG
 **			WDT在DEBUG模式中关闭
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
#define		WDT_DISABLE_DEBUG()	do{\
									WDT->LOCK = WDT_LOCK_WRITE_KEY;\
									WDT->CON &= ~(WDT_WDTCON_DEBUG_Msk);\
									WDT->LOCK = 0x0;\
								}while(0)
							

/*****************************************************************************
 ** 功能：	开启WDT溢出复位系统
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	(1)使能WDT 复位，当发生WDT 中断后没有清中断标志位，下次发生WDT中断时触发WDT复位.
 **			(2)当使能复位时，都会使能WDT中断.
*****************************************************************************/
void WDT_EnableRestSystem(void);

/*****************************************************************************
 ** 功能：	关闭WDT溢出复位系统
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WDT_DisableRestSystem(void);

/*****************************************************************************
 ** 功能：	配置WDT时钟
 ** 参数： [in] ClkDiv: (1)WDT_CLK_DIV_1   
 **						(2)WDT_CLK_DIV_16  
 **						(3)WDT_CLK_DIV_256 
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void WDT_ConfigClk(uint32_t ClkDiv);

/*****************************************************************************
 ** 功能：	配置WDT溢出周期
 ** 参数： [in] Period: 32BitValue
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_ConfigPeriod(uint32_t Period);

/*****************************************************************************
 ** 功能：	开启WDT溢出中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_EnableOverflowInt(void);


/*****************************************************************************
 ** 功能：	关闭WDT溢出中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void WDT_DisableOverflowInt(void);

/*****************************************************************************
 ** 功能：	获取WDT使能并产生中断标志
 ** 参数： [in] none
 ** 返回：  1:使能中断并产生中断 0：无中断
 ** 说明：	 
*****************************************************************************/
uint32_t WDT_GetOverflowIntFlag(void);

/*****************************************************************************
 ** 功能：	清除WDT中断标志并重新加载初值
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WDT_ClearOverflowIntFlag(void);

/*****************************************************************************
 ** 功能：	获取WDT计数值
 ** 参数： [in] none
 ** 返回： 32bit value
 ** 说明：	 
*****************************************************************************/
uint32_t WDT_GetTimingData(void);

/*****************************************************************************
 ** 功能：	喂狗
 ** 参数： [in] none
 ** 返回： none
 ** 说明：	 
*****************************************************************************/
void WDT_ClearWDT(void);


#ifdef __cplusplus
}
#endif

#endif /* _PREG_WDT_H_ */

