/*****************************************************************************
* 文件名：	Psfr_adc.c
* 功能：	
* 作者：	陈国华
* 日期：	2021.10.03
* 备注：	
*****************************************************************************/
#ifndef _PREG_ADC1_H_
#define _PREG_ADC1_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "cms32f033x.h"

/*----------------------------------------------------------------------------
 **ADC1 时钟
-----------------------------------------------------------------------------*/
#define		ADC1_CLK_DIV_1		(0x0UL)			/*Fadc = Fapb / 1*/
#define		ADC1_CLK_DIV_2		(0x1UL)			/*Fadc = Fapb / 2*/
#define		ADC1_CLK_DIV_4		(0x2UL)			/*Fadc = Fapb / 4*/			
#define		ADC1_CLK_DIV_8		(0x3UL)			/*Fadc = Fapb / 8*/
#define		ADC1_CLK_DIV_16		(0x4UL)			/*Fadc = Fapb / 16*/			
#define		ADC1_CLK_DIV_32		(0x5UL)			/*Fadc = Fapb / 32*/
#define		ADC1_CLK_DIV_64		(0x6UL)			/*Fadc = Fapb / 64*/
#define		ADC1_CLK_DIV_128	(0x7UL)			/*Fadc = Fapb / 128*/
/*----------------------------------------------------------------------------
 **ADC1 采样保持时间选择
-----------------------------------------------------------------------------*/
#define		ADC1_HOLD_3P5_CLK	(0x00UL)		/*采样保持3.5 个ADC clock cycles*/
#define		ADC1_HOLD_4P5_CLK	(0x01UL<<ADC1_CON_ADCSHT_Pos)	/*采样保持4.5 个ADC clock cycles*/
#define		ADC1_HOLD_6P5_CLK	(0x02UL<<ADC1_CON_ADCSHT_Pos)	/*采样保持6.5 个ADC clock cycles*/
#define		ADC1_HOLD_10P5_CLK	(0x03UL<<ADC1_CON_ADCSHT_Pos)	/*采样保持10.5 个ADC clock cycles*/


/*----------------------------------------------------------------------------
 **ADC1 转换模式
-----------------------------------------------------------------------------*/
#define		ADC1_CONVERT_SINGLE			(0x0UL)			/*对指定通道执行一次A/D 转换*/
#define		ADC1_CONVERT_CONTINUOUS		(0x1UL<<ADC1_CON_ADCMS_Pos)	/*对所有选定的通道都执行A/D 转换*/


/*----------------------------------------------------------------------------
 **ADC1 外部触发边沿选择
-----------------------------------------------------------------------------*/
#define		ADC1_TG_EXT_FALLING			((0x0UL)|ADC1_HWTG_ADCEXTEN_Msk)			/*外部硬件下降沿触发*/
#define		ADC1_TG_EXT_RISING			((0x1UL<<ADC1_HWTG_ADCEXTES_Pos)|ADC1_HWTG_ADCEXTEN_Msk)	/*外部硬件上升沿触发*/			

/*----------------------------------------------------------------------------
 **ADC1 采样通道
-----------------------------------------------------------------------------*/
#define		ADC1_CH_0					(0x0UL)			
#define		ADC1_CH_1					(0x1UL)	
#define		ADC1_CH_2					(0x2UL)			
#define		ADC1_CH_3					(0x3UL)			
#define		ADC1_CH_4					(0x4UL)		
#define		ADC1_CH_5					(0x5UL)			
#define		ADC1_CH_6					(0x6UL)	
#define		ADC1_CH_7					(0x7UL)			
#define		ADC1_CH_8					(0x8UL)			
#define		ADC1_CH_9					(0x9UL)		
#define		ADC1_CH_10					(0xAUL)			
#define		ADC1_CH_11					(0xBUL)	
#define		ADC1_CH_12					(0xCUL)			
#define		ADC1_CH_13					(0xDUL)			
#define		ADC1_CH_14					(0xEUL)		
#define		ADC1_CH_15					(0xFUL)			
#define		ADC1_CH_16					(0x10UL)	
#define		ADC1_CH_17					(0x11UL)			
#define		ADC1_CH_18					(0x12UL)			
#define		ADC1_CH_19					(0x13UL)
#define		ADC1_CH_20					(0x14UL)			
#define		ADC1_CH_21					(0x15UL)	
#define		ADC1_CH_22					(0x16UL)			
#define		ADC1_CH_23					(0x17UL)			
#define		ADC1_CH_24					(0x18UL)		
#define		ADC1_CH_25					(0x19UL)			
#define		ADC1_CH_26					(0x1AUL)	
#define		ADC1_CH_27					(0x1BUL)			
#define		ADC1_CH_28					(0x1CUL)			
#define		ADC1_CH_29					(0x1DUL)
#define		ADC1_CH_30					(0x1EUL)

#define		ADC1_CH_0_MSK				(0x1UL)			
#define		ADC1_CH_1_MSK				(0x2UL)	
#define		ADC1_CH_2_MSK				(0x4UL)			
#define		ADC1_CH_3_MSK				(0x8UL)			
#define		ADC1_CH_4_MSK				(0x10UL)		
#define		ADC1_CH_5_MSK				(0x20UL)			
#define		ADC1_CH_6_MSK				(0x40UL)	
#define		ADC1_CH_7_MSK				(0x80UL)			
#define		ADC1_CH_8_MSK				(0x100UL)			
#define		ADC1_CH_9_MSK				(0x200UL)		
#define		ADC1_CH_10_MSK				(0x400UL)			
#define		ADC1_CH_11_MSK				(0x800UL)	
#define		ADC1_CH_12_MSK				(0x1000UL)			
#define		ADC1_CH_13_MSK				(0x2000UL)			
#define		ADC1_CH_14_MSK				(0x4000UL)		
#define		ADC1_CH_15_MSK				(0x8000UL)			
#define		ADC1_CH_16_MSK				(0x10000UL)	
#define		ADC1_CH_17_MSK				(0x20000UL)			
#define		ADC1_CH_18_MSK				(0x40000UL)			
#define		ADC1_CH_19_MSK				(0x80000UL)
#define		ADC1_CH_20_MSK				(0x100000UL)			
#define		ADC1_CH_21_MSK				(0x200000UL)	
#define		ADC1_CH_22_MSK				(0x400000UL)			
#define		ADC1_CH_23_MSK				(0x800000UL)			
#define		ADC1_CH_24_MSK				(0x1000000UL)		
#define		ADC1_CH_25_MSK				(0x2000000UL)			
#define		ADC1_CH_26_MSK				(0x4000000UL)	
#define		ADC1_CH_27_MSK				(0x8000000UL)			
#define		ADC1_CH_28_MSK				(0x10000000UL)			
#define		ADC1_CH_29_MSK				(0x20000000UL)
#define		ADC1_CH_30_MSK				(0x40000000UL)

#define		ADC1_CH_ALL_MSK				(0x7FFFFFFFUL)
#define		ADC1_CN_NUM					(31)			// ADC1通道个数
/*----------------------------------------------------------------------------
 **ADC1 	AN30选择内部模拟通道
-----------------------------------------------------------------------------*/
#define		ADC1_CH_30_BG			(0x00UL<<ADC1_CON_ADCICHS_Pos)		/*Bandgap 1.2V*/
#define		ADC1_CH_30_OP0O			(0x01UL<<ADC1_CON_ADCICHS_Pos)		/*运放0 的输出*/
#define		ADC1_CH_30_OP1O			(0x02UL<<ADC1_CON_ADCICHS_Pos)		/*运放1 的输出*/
#define		ADC1_CH_30_PGA0O		(0x03UL<<ADC1_CON_ADCICHS_Pos)		/*PGA0 的输出*/
#define		ADC1_CH_30_PGA1O		(0x04UL<<ADC1_CON_ADCICHS_Pos)		/*PGA1 的输出*/
#define		ADC1_CH_30_VREF_VSS		(0x05UL<<ADC1_CON_ADCICHS_Pos)		/*ADC 参考负端*/
#define		ADC1_CH_30_VREF_VDD		(0x06UL<<ADC1_CON_ADCICHS_Pos)		/*ADC 参考正端*/
#define		ADC1_CH_30_VSS			(0x07UL<<ADC1_CON_ADCICHS_Pos)		

/*----------------------------------------------------------------------------
 **ADC1   比较
-----------------------------------------------------------------------------*/
#define		ADC1_CMP_LESS_THAN_RESULT		(0x00UL)		/*ADC 结果 < 预设值*/
#define		ADC1_CMP_NOT_LESS_THAN_RESULT	(0x01UL<<ADC1_CMP0_ADCCMP0COND_Pos)		/*ADC 结果>=预设值*/

#define		ADC1_CMP_SPEED_32M				(0x00UL)		/*支持FADC 高达32MHz*/
#define		ADC1_CMP_SPEED_4M				(0x01UL<<ADC1_CON_ADCSS_Pos)	/*支持FADC 高达4MHz*/


/*----------------------------------------------------------------------------
 **ADC1   写保护
-----------------------------------------------------------------------------*/
#define		ADC1_LOCK_WRITE_KEY		(0x55UL)




/*****************************************************************************
 ** 功能：	获取ADC1转换结束/空闲标志位
 ** 参数： [in] none
 ** 返回：  1：忙   0：空闲/转换完成
 ** 说明：	 
*****************************************************************************/
#define	ADC1_IS_BUSY()		((ADC1->CON2&ADC1_CON2_ADCST_Msk)? 1:0)

/*****************************************************************************
 ** 功能：	获取ADC1转换结束/空闲标志位
 ** 参数： [in] none
 ** 返回：  0：忙   1：空闲/转换完成
 ** 说明：	 
*****************************************************************************/
#define	ADC1_IS_IDLE()		((ADC1->CON2&ADC1_CON2_ADCST_Msk)? 0:1)



/*****************************************************************************
 ** 功能：	开启ADC1转换
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
__STATIC_INLINE	void ADC1_Go(void)
{
	ADC1->LOCK = ADC1_LOCK_WRITE_KEY;
	ADC1->CON2 |= ADC1_CON2_ADCST_Msk;
	ADC1->LOCK = 0x00;
}


/*****************************************************************************
 ** 功能：	设置ADC运行模式
 ** 参数： [in] ConvertMode:(1)ADC1_CONVERT_SINGLE			
 **							(2)ADC1_CONVERT_CONTINUOUS
 **				ClkDiv :(1)ADC1_CLK_DIV_1
 **						(2)ADC1_CLK_DIV_2
 **						(3)ADC1_CLK_DIV_4
 **						(4)ADC1_CLK_DIV_8
 **						(5)ADC1_CLK_DIV_16
 **						(6)ADC1_CLK_DIV_32
 **						(7)ADC1_CLK_DIV_64
 **						(8)ADC1_CLK_DIV_128
 **				HoldTime:(1)ADC1_HOLD_3P5_CLK
 **						 (2)ADC1_HOLD_4P5_CLK
 **						 (3)ADC1_HOLD_6P5_CLK
 **						 (4)ADC1_HOLD_10P5_CLK
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ConfigRunMode(uint32_t ConvertMode, uint32_t ClkDiv,uint32_t HoldTime);

/*****************************************************************************
 ** 功能：	开启ADC1转换通道
 ** 参数： [in] ChannelMask: ADC1_CH_0_MSK ~ ADC1_CH_30_MSK
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableScanChannel(uint32_t ChannelMask);

/*****************************************************************************
 ** 功能：	关闭ADC1转换通道
 ** 参数： [in] ChannelMask: ADC1_CH_0_MSK ~ ADC1_CH_30_MSK
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableScanChannel(uint32_t ChannelMask);

/*****************************************************************************
 ** 功能：	设置AN30内部模拟源
 ** 参数： [in] AN30Channel: (1)ADC1_CH_30_BG 
 **							 (2)ADC1_CH_30_OP0O
 **							 (3)ADC1_CH_30_OP1O
 **							 (4)ADC1_CH_30_PGA0O
 **							 (5)ADC1_CH_30_PGA1O
 **							 (6)ADC1_CH_30_VREF_VSS
 **							 (7)ADC1_CH_30_VREF_VDD
 **							 (8)ADC1_CH_30_VSS
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_SetAN30Channel(uint32_t AN30Channel);

/*****************************************************************************
 ** 功能：	获取ADC1转换结果
 ** 参数： [in] Channel: ADC1_CH_0 ~ ADC1_CH_30
 ** 返回：  12 bits Value
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetResult(uint32_t Channel);

/*****************************************************************************
 ** 功能：	开启硬件触发ADC1转换功能
 ** 参数： [in] TriggerSource: (1)ADC1_TG_EXT_FALLING
 **							(2)ADC1_TG_EXT_RISING
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableHardwareTrigger(uint32_t TriggerSource);

/*****************************************************************************
 ** 功能：	关闭硬件触发ADC1转换功能
 ** 参数： [in] TriggerSource: (1)ADC1_TG_EXT_FALLING
 **								(2)ADC1_TG_EXT_RISING
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableHardwareTrigger(uint32_t TriggerSource);

/*****************************************************************************
 ** 功能：	开启ADC1比较功能
 ** 参数： [in]none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableCompare(void);

/*****************************************************************************
 ** 功能：	关闭ADC1比较功能
 ** 参数： [in] Compare : ADC1_CMP0 、ADC1_CMP1
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableCompare(void);

/*****************************************************************************
 ** 功能：	配置ADC1比较功能
 ** 参数： [in]  CmpMode:(1)ADC1_CMP_LESS_THAN_RESULT
 **						(2)ADC1_CMP_NOT_LESS_THAN_RESULT
 **				 CmpCount: 0x00~0xf  预设比较次数
 **				 CmpChannel: ADC1_CH_0 ~ ADC1_CH_30
 **				 CmpData : 12 bit 比较值
 ** 返回：  none
 ** 说明：	当内部计数器等于ADCCMPxMCNT+1的值时产生ADC比较事件。
*****************************************************************************/
void ADC1_ConfigCompare( uint32_t CmpMode, uint32_t CmpCount, uint32_t CmpChannel, uint32_t CmpData);

/*****************************************************************************
 ** 功能：	获取ADC1比较器结果
 ** 参数： [in] Compare : ADC1_CMP0 、ADC1_CMP1
 ** 返回：  1 /0
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetCompareResult(uint32_t Compare);


/*****************************************************************************
 ** 功能：	开启ADC1
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_Start(void);

/*****************************************************************************
 ** 功能：	关闭ADC1
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_Stop(void);

/*****************************************************************************
 ** 功能：	开启ADC1校准
 ** 参数： [in] none
** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_StartAdjust(void);

/*****************************************************************************
 ** 功能：	开启ADC1带有校准数据的ADC转换
 ** 参数： [in] none
 ** 返回：   none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableAdjust(void);

/*****************************************************************************
 ** 功能：	关闭ADC1带有校准数据的ADC转换
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableAdjust(void);

/*****************************************************************************
 ** 功能：	复位ADC1
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableReset(void);

/*****************************************************************************
 ** 功能：	获取ADC1 转换错误标志位
 ** 参数： [in] none
 ** 返回：  1 ：转换出现错误	0：无错误
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetConvertErrorFlag(void);

/*****************************************************************************
 ** 功能：	获取ADC1 校准错误标志位
 ** 参数： [in] none
 ** 返回：  1 ：校准出现错误	0：无错误
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetAdjustErrorFlag(void);

/*****************************************************************************
 ** 功能：	清除ADC1 转换错误标志位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ClearConvertErrorFlag(void);

/*****************************************************************************
 ** 功能：	清除ADC1 校准错误标志位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ClearAdjustErrorFlag(void);

/*****************************************************************************
 ** 功能：	开启ADC1比较中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	 
*****************************************************************************/
void ADC1_EnableCompareInt(void);

/*****************************************************************************
 ** 功能：	关闭ADC1比较中断
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableCompareInt(void);

/*****************************************************************************
 ** 功能：	获取ADC1比较中断使能并且产生中断标志位
 ** 参数： [in] none
 ** 返回：  1:中断使能并且产生中断 0：无中断
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetCompareIntFlag(void);

/*****************************************************************************
 ** 功能：	清除ADC1比较中断标志位
 ** 参数： [in] none
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ClearCompareIntFlag(void);

/*****************************************************************************
 ** 功能：	开启ADC1通道n中断
 ** 参数： [in]ChannelMask: ADC1_CH_0_MSK ~ ADC1_CH_30_MSK
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_EnableChannelInt(uint32_t ChannelMask);

/*****************************************************************************
 ** 功能：	关闭ADC1通道n中断
 ** 参数： [in] ChannelMask: ADC1_CH_0_MSK ~ ADC1_CH_30_MSK
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_DisableChannelInt(uint32_t ChannelMask);

/*****************************************************************************
 ** 功能：	获取ADC1通道n中断使能并且产生中断标志位
 ** 参数： [in] Channel:ADC1_CH_0 ~ ADC1_CH_30
 ** 返回：  1:中断使能并且产生中断 0：无中断
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetChannelIntFlag(uint32_t Channel);

/*****************************************************************************
 ** 功能：	清除ADC1通道n中断标志位
 ** 参数： [in] Channel:ADC1_CH_0 ~ ADC1_CH_30
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ClearChannelIntFlag(uint32_t Channel);

/*****************************************************************************
 ** 功能：	获取ADC1通道n允许扫描标志位
 ** 参数： [in] Channel:ADC1_CH_0 ~ ADC1_CH_30
 ** 返回：  1:允许扫描 0：禁止扫描
 ** 说明：	
*****************************************************************************/
uint32_t ADC1_GetChannelScanFlag(uint32_t Channel);

/*****************************************************************************
 ** 功能：	指定AN通道对应管脚配置为模拟方式
 ** 参数： [in] Channel:ADC1_CH_0 ~ ADC1_CH_29
 ** 返回：  none
 ** 说明：	
*****************************************************************************/
void ADC1_ConfigPinAN(uint32_t Channel);



#ifdef __cplusplus
}
#endif

#endif /* _PREG_ADC1_H_ */

